In [2]:
#https://t.zsxq.com/02nYfYbA2
import pandas as pd

In [10]:
df = pd.read_clipboard()
df

    a   b   c
0   0   2   3
1   0   4   1
2  10  20  30
1  20  30  40

In [15]:
df.at[1,'a']

1     0
1    20
Name: a, dtype: int64

In [18]:
list(df.at[1,'a'])[0]

0

In [19]:
df.iat[1, 2] = 10
df.iat[1, 2]

10

In [20]:
df

    a   b   c
0   0   2   3
1   0   4  10
2  10  20  30
1  20  30  40

In [21]:
df.loc[0].iat[1]

2